Revit 2027 API
RebarShapeConstraintSegmentLength Constructor
 Create a segment length constraint.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarShapeConstraintSegmentLength(
	ElementId paramId,
	RebarShapeSegmentEndReferenceType refType0,
	RebarShapeSegmentEndReferenceType refType1
)
Public Sub New (
	paramId As ElementId,
	refType0 As RebarShapeSegmentEndReferenceType,
	refType1 As RebarShapeSegmentEndReferenceType
)
public:
RebarShapeConstraintSegmentLength(
	ElementId^ paramId,
	RebarShapeSegmentEndReferenceType refType0,
	RebarShapeSegmentEndReferenceType refType1
)
new :
        paramId : ElementId *
        refType0 : RebarShapeSegmentEndReferenceType *
        refType1 : RebarShapeSegmentEndReferenceType -> RebarShapeConstraintSegmentLength
Parameters
paramId ElementId
 The Id of a Rebar Shape parameter.
refType0 RebarShapeSegmentEndReferenceType
 Choose between two possibilities for the first reference of the length constraint.
refType1 RebarShapeSegmentEndReferenceType
 Choose between two possibilities for the second reference of the length constraint.
Exceptions
Exception | Condition
ArgumentException |  paramId is not a valid Element identifier.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
RebarShapeConstraintSegmentLength Class
Autodesk.Revit.DB.Structure Namespace